test-imageproxy.txt
Server Hostname:        localhost
Server Port:            8085

Document Path:          /854x480/http://origin/1700KB.jpg
Document Length:        68505 bytes

Concurrency Level:      10
Time taken for tests:   92.633 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      13764600 bytes
HTML transferred:       13701000 bytes
Requests per second:    2.16 [#/sec] (mean)
Time per request:       4631.672 [ms] (mean)
Time per request:       463.167 [ms] (mean, across all concurrent requests)
Transfer rate:          145.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   671 4560 403.5   4617    5543
Waiting:      671 4555 403.6   4612    5541
Total:        671 4560 403.5   4618    5543