test-imgproxy.txt
Server Software:        imgproxy
Server Hostname:        localhost
Server Port:            8081

Document Path:          /insecure/rs:fill:854:480/el:true/g:ce:0:0/plain/http://origin/1700KB.jpg
Document Length:        24008 bytes

Concurrency Level:      10
Time taken for tests:   12.965 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      4859400 bytes
HTML transferred:       4801600 bytes
Requests per second:    15.43 [#/sec] (mean)
Time per request:       648.227 [ms] (mean)
Time per request:       64.823 [ms] (mean, across all concurrent requests)
Transfer rate:          366.04 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   172  631 107.2    628     954
Waiting:      172  631 107.2    628     953
Total:        172  631 107.2    628     954