test-picfit.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8084

Document Path:          /display?w=854&h=480&op=thumbnail&url=https%3A%2F%2Fraw.githubusercontent.com%2Fmamchyts%2Fbenchmark-thumbnails%2Fmaster%2Fpexels-magda-ehlers.jpg
Document Length:        68505 bytes

Concurrency Level:      5
Time taken for tests:   22.889 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      3433058 bytes
HTML transferred:       3425250 bytes
Requests per second:    2.18 [#/sec] (mean)
Time per request:       2288.862 [ms] (mean)
Time per request:       457.772 [ms] (mean, across all concurrent requests)
Transfer rate:          146.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   864 1907 1001.7   1626    5305
Waiting:      863 1893 995.3   1624    5303
Total:        864 1907 1001.7   1626    5305

Percentage of the requests served within a certain time (ms)
  50%   1626
  66%   2153
  75%   2429
  80%   2537
  90%   3437
  95%   4296
  98%   5305
  99%   5305
 100%   5305 (longest request)