test-picfit.txt
Server Software:        
Server Hostname:        localhost
Server Port:            8084

Document Path:          /display?w=854&h=480&op=thumbnail&url=http://origin/1700KB.jpg
Document Length:        68505 bytes

Concurrency Level:      10
Time taken for tests:   91.413 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      13740670 bytes
HTML transferred:       13701000 bytes
Requests per second:    2.19 [#/sec] (mean)
Time per request:       4570.644 [ms] (mean)
Time per request:       457.064 [ms] (mean, across all concurrent requests)
Transfer rate:          146.79 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   621 4518 429.6   4606    5348
Waiting:      620 4517 429.5   4606    5347
Total:        621 4518 429.6   4606    5348