test-thumbor.txt
# !!! thumbor is tested with 1 process

Server Software:        Thumbor/7.0.8
Server Hostname:        localhost
Server Port:            8082

Document Path:          /unsafe/854x480/http://origin/1700KB.jpg
Document Length:        28067 bytes

Concurrency Level:      10
Time taken for tests:   71.131 seconds
Complete requests:      200
Failed requests:        0
Total transferred:      5664400 bytes
HTML transferred:       5613400 bytes
Requests per second:    2.81 [#/sec] (mean)
Time per request:       3556.549 [ms] (mean)
Time per request:       355.655 [ms] (mean, across all concurrent requests)
Transfer rate:          77.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   360 3461 469.8   3539    3749
Waiting:      360 3461 469.8   3539    3749
Total:        360 3461 469.8   3539    3749